import React from 'react'
import Navibar from '../nav/Navibar'
import Fterpage from '../footer/Fterpage'


function Holyday1() {
  return (
    <div>
        <Navibar></Navibar>
        <h1>วันมาฆบูชา</h1>
        <h4>ประวัติความเป็นมา</h4>
        <p>วันมาฆบูชา ตรงกับวันขึ้น 15 ค่ำ เดือน 3 ถือเป็นวันสำคัญทางพระพุทธศาสนาวันหนึ่ง 
          สำหรับประวัติวันมาฆบูชา ความสำคัญของวันมาฆบูชา รวมถึงกิจกรรมที่พุทธศาสนิกชนควรปฏิบัติมีอะไรบ้าง</p>

        <h4>ความหมายของวันมาฆบูชา</h4>
        <p>คำว่า "มาฆะ" นั้น เป็นชื่อของเดือน 3 ย่อมาจากคำว่า "มาฆบุรณมี" หมายถึง 
          การบูชาพระในวันเพ็ญกลางเดือนมาฆะตามปฏิทินของอินเดีย หรือเดือน 3</p>

        <h4>การกำหนดวันมาฆบูชา</h4>
        <p>ความสำคัญของวันมาฆบูชา คือเป็นวันที่พระสัมมาสัมพุทธเจ้าทรงแสดง "โอวาทปาติโมกข์"แก่พระสงฆ์เป็นครั้งแรก 
          หลังจากตรัสรู้มาแล้วเป็นเวลา 9 เดือน ซึ่งหลักคำสอนนี้เป็นหลักการ และวิธีการปฏิบัติต่าง ๆ 
          หากสรุปเป็นใจความสำคัญ จะมีเนื้อหาว่า "ทำความดี ละเว้นความชั่ว ทำจิตใจให้บริสุทธิ์"</p>
        <Fterpage></Fterpage>
    </div>
  )
}

export default Holyday1