import React from 'react'
import Navibar from '../../component/nav/Navibar'
import CarouselPage from '../../component/carousel/CarouselPage'
import Fterpage from '../../component/footer/Fterpage'
import { motion } from 'framer-motion'
import "./Holyday.css"
import { Link } from 'react-router-dom'

function Holyday2() {
  return (
    <div>
        <Navibar></Navibar>
        <CarouselPage></CarouselPage>
        <motion.div
      initial={{ opacity: 0, scale: 0.5 }}
      animate={{ opacity: 1, scale: 1 }}
      transition={{ duration: 0.5 }}
      >
        <div className='text-info'>
          <Link to='/'>
            <button class="custom-button">
                หน้าหลัก
            </button>
          </Link>
                <h1>วันวิสาขบูชา</h1>
                  <img
                    alt="img5"
                    src="./img/img5.jpg"
                    className="image1"
                  />
                <h4>ประวัติความเป็นมา</h4>
                  <p>เป็นวันที่สมเด็จพระอรหันตสัมมาสัมพุทธเจ้า ประสูติ ตรัสรู้ และปรินิพพาน 
                  ซึ่งเกิดขึ้นในวันและเดือนเดียวกัน คือ ในวันเพ็ญ (ขึ้น ๑๕ ค่ำ) เดือนหก หรือเดือนเวสาขะ พระจันทร์เสวยวิสาขฤกษ์</p>

                <h4>ความสำคัญของวันวิสาขบูชา</h4>
                  <p>วันวิสาขบูชา เป็นวันที่ระลึกถึงวันที่องค์สมเด็จพระสัมมาสัมพุทธเจ้าทรงประสูติ ตรัสรู้ 
                    และปรินิพพาน ซึ่งตรงกับวันเพ็ญ เดือนวิสาขมาส (เดือน 6) บรรจบกันทั้ง 3 คราว ได้แก่</p>
                  <p>1. เช้าวันศุกร์ ขึ้น 15 ค่ำ เดือน 6 ปีจอ ก่อนพุทธศักราช 80 ปี เจ้าชายสิทธัตถะ 
                          ทรงประสูติที่พระราชอุทยานลุมพินีวัน ซึ่งตั้งอยู่ระหว่างกรุงกบิลพัสดุ์กับเทวทหะ </p>
                  <p>2. เช้ามืดวันพุธ ขึ้น 15 ค่ำ เดือน 6 ปีระกา ก่อนพุทธศักราช 45 ปี เจ้าชายสิทธัตถะ ทรงตรัสรู้เป็นพระสัมมาสัมพุทธเจ้าเมื่อมีพระชนมายุได้ 35 พรรษา 
                        ณ ใต้ร่มไม้ศรีมหาโพธิ์ ริมฝั่งแม่น้ำเนรัญชรา ตำบลอุรุเวลาเสนานิคม 
                        ภายหลังจากการออกผนวชได้ 6 ปี ปัจจุบัน สถานที่แห่งนี้เรียกว่า พุทธคยา เป็นตำบลหนึ่งของเมืองคยา แห่งรัฐพิหาร ประเทศอินเดีย</p>
                  <p>3. ภายหลังจากการตรัสรู้ องค์พระสัมมาสัมพุทธเจ้าทรงออกประกาศพระธรรมวินัย และโปรดเวไนยสัตว์เป็นเวลา 45 ปี เมื่อมีพระชนมายุได้ 80 พรรษา 
                          พระองค์ก็เสด็จดับขันธปรินิพพาน เมื่อวันอังคาร ขึ้น 15 ค่ำ เดือน 6 ปีมะเส็ง ณ สาลวโนทยาน ของมัลลกษัตริย์ 
                          เมืองกุสินารา แคว้นมัลละ ปัจจุบันอยู่ในเมืองกุสีนคระ รัฐอุตตรประเทศ ประเทศอินเดีย</p>
                
                <h4>ประวัติวันมาฆบูชาในประเทศไทย</h4>
                  <p>จากหลักฐานพบว่า วันวิสาขบูชา ได้เริ่มขึ้นครั้งแรกเมื่อสมัยสุโขทัยเป็นราชธานี ซึ่งสันนิษฐานว่าได้รับแบบแผนมาจากลังกาเมื่อประมาณ พ.ศ. 420 โดยพระเจ้าภาติกุราช กษัตริย์แห่งกรุงลังกาได้เป็นผู้ประกอบพิธีวิสาขบูชาขึ้นเพื่อถวายเป็นพุทธบูชา 
                    นับจากนั้นกษัตริย์แห่งลังกาพระองค์อื่นๆ ก็ได้ถือปฏิบัติประเพณีวิสาขบูชานี้สืบต่อกันมา ส่วนการเผยแพร่เข้ามาในประเทศไทยนั้นอาจเป็นเพราะเมื่อครั้งสมัยสุโขทัย ประเทศไทยมีความสัมพันธ์ด้านพระพุทธศาสนากับประเทศลังกาอย่างใกล้ชิด 
                    จะเห็นได้ว่ามีพระสงฆ์จากเมืองลังกาหลายรูปเดินทางเข้ามาเผยแพร่พระพุทธศาสนาและนำการประกอบพิธีวิสาขบูชาเข้ามาปฏิบัติในประเทศไทยด้วย ซึ่งการปฏิบัติพิธีวิสาขบูชาในสมัยสุโขทัยนั้น ได้มีการบันทึกเอาไว้ในหนังสือ นางนพมาศ
                  </p>

                  <p>
                  สรุปใจความได้ว่า เมื่อถึงวันวิสาขบูชา พระเจ้าแผ่นดิน ข้าราชบริพาร ทั้งฝ่ายหน้า และฝ่ายใน ตลอดทั้งประชาชนชาวสุโขทัย 
                  จะช่วยกันประดับตกแต่งพระนคร ด้วยดอกไม้ พร้อมกับจุดประทีปโคมไฟให้ดูสว่างไสวไปทั่วพระนคร เป็นเวลา 3 วัน 3 คืน 
                  เพื่อเป็นการบูชาพระรัตนตรัย ขณะที่พระมหากษัตริย์ และบรมวงศานุวงศ์ ก็ทรงศีล และทรงบำเพ็ญพระราชกุศลต่าง ๆ ครั้นตกเวลาเย็นก็เสด็จพระราชดำเนินพร้อมด้วยพระบรมวงศานุวงศ์ 
                  และนางสนองพระโอษฐ์ตลอดจนข้าราชการทั้งฝ่ายหน้า และฝ่ายในไปยังพระอารามหลวง เพื่อทรงเวียนเทียนรอบพระประธาน ส่วนชาวสุโขทัยจะรักษาศีล 
                  ฟังธรรม ถวายสลากภัต สังฆทาน อาหารบิณฑบาตแด่พระภิกษุสามเณร บริจาคทานแก่คนยากจน ทำบุญไถ่ชีวิตสัตว์ ฯลฯ
                  </p>

                  <p>
                  ต่อมาภายหลังจากสมัยสุโขทัย ประเทศไทยได้รับอิทธิพลของศาสนาพราหมณ์เพิ่มมากขึ้น ส่งผลให้ในช่วงสมัยกรุงศรีอยุธยา ธนบุรี 
                  และรัตนโกสินทร์ตอนต้นไม่มีปรากฏหลักฐานการประกอบพิธีวิสาขบูชา จนกระทั่งมาถึงในรัชสมัยของพระบาทสมเด็จพระพุทธเลิศหล้านภาลัย รัชกาลที่ 2 (พ.ศ. 2360) 
                  พระองค์ทรงมีพระราชดำริที่จะฟื้นฟูพิธีวิสาขบูชาขึ้นใหม่ โดยสมเด็จพระสังฆราช (มี) สำนักวัดราชบูรณะ ถวายพระพรให้ทรงทำขึ้นครั้งแรกในวันขึ้น 14 ค่ำ 15 ค่ำ และแรม 1 ค่ำ เดือน 6 พ.ศ. 2360 
                  โดยให้จัดทำตามแบบอย่างประเพณีเดิมทุกประการ เพื่อให้ประชาชนได้ทำบุญ ทำกุศลทั่วหน้ากัน 
                  อีกทั้งการรื้อฟื้นพิธีวิสาขบูชาขึ้นมาในครานี้ถือว่าเป็นแบบอย่างปฏิบัติในการประกอบพิธีวิสาขบูชาต่อเนื่องมาจนถึงปัจจุบัน
                  </p>
            </div>
            </motion.div>
        <Fterpage></Fterpage>
    </div>
  )
}

export default Holyday2